Revit 2027 API
BuiltInFailures.GeneralFailures.ErrorInSymbolFamilyResolved Property
 An error occurred in family "[Name]" and was automatically resolved, but may require review by the family creator.\nError Information:\n"[Text]"\nError Resolution: [Resolution]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ErrorInSymbolFamilyResolved { get; }
Public Shared ReadOnly Property ErrorInSymbolFamilyResolved As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ErrorInSymbolFamilyResolved {
	FailureDefinitionId^ get ();
}
static member ErrorInSymbolFamilyResolved : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace